In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
Dic = {1:'yara',2:'sara',3:'lara'}
ser =pd.Series(Dic)
print(ser)

1    yara
2    sara
3    lara
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
ser.index = [11,12,13]
ser

11    yara
12    sara
13    lara
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
ser[1:3]

12    sara
13    lara
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [5]:
sernew = pd.Series({14: 'nora', 15: 'sara'})
ser1 = pd.concat([ser,sernew])

In [6]:
ser1

11    yara
12    sara
13    lara
14    nora
15    sara
dtype: object

In [9]:
ser1.drop_duplicates()

11    yara
12    sara
13    lara
14    nora
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [7]:
dic2 = {'ID':[1123, 1143,2312],
        'NAME':['YARA','SARA','LARA']}
# creating a dataframe 
df = pd.DataFrame(dic2 ,columns = ['ID','NAME'])
df

     ID  NAME
0  1123  YARA
1  1143  SARA
2  2312  LARA

## Q6: Read educ_figdp_1_Data.csv file

In [10]:
df2 = pd.read_csv("educ_figdp_1_Data.csv")
df2.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [12]:
#using loc 
df2.loc[1:2]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [15]:
#using slice 
df2[:2]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN